cats99/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        @cat.age = @cat.calculate_age(cat_params[:birth_date])

        if @cat.save
---
INSERT INTO "cats" ("birth_date", "age", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update
        @cat = Cat.find_by(id: params[:id])

        @cat.age = @cat.calculate_age(cat_params[:birth_date])

        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = ?, "color" = ?, "name" = ?, "sex" = ?, "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["birth_date", "2000-09-11"], ["color", "tabby"], ["name", "Jenny"], ["sex", "F"], ["description", "this is our first female cat"], ["updated_at", "2022-07-01 21:00:47.800057"], ["id", 2]]